{
  "Linear Baseline": {
    "handle": "<pylibraft.common.handle.Handle object at 0x7a526e29b930>",
    "verbose": 4,
    "output_type": "input",
    "algorithm": "eig",
    "fit_intercept": true,
    "copy_X": true,
    "normalize": false
  },
  "Ridge": {
    "handle": "<pylibraft.common.handle.Handle object at 0x7a526e3221f0>",
    "verbose": 4,
    "output_type": "input",
    "solver": "eig",
    "fit_intercept": true,
    "normalize": false,
    "alpha": 0.0016505466575697575
  },
  "Gradient Boosting": {
    "objective": "reg:squarederror",
    "base_score": null,
    "booster": null,
    "callbacks": null,
    "colsample_bylevel": null,
    "colsample_bynode": null,
    "colsample_bytree": null,
    "device": "cuda",
    "early_stopping_rounds": null,
    "enable_categorical": false,
    "eval_metric": null,
    "feature_types": null,
    "feature_weights": null,
    "gamma": null,
    "grow_policy": null,
    "importance_type": null,
    "interaction_constraints": null,
    "learning_rate": 0.12500344574628938,
    "max_bin": null,
    "max_cat_threshold": null,
    "max_cat_to_onehot": null,
    "max_delta_step": null,
    "max_depth": 6,
    "max_leaves": null,
    "min_child_weight": null,
    "missing": NaN,
    "monotone_constraints": null,
    "multi_strategy": null,
    "n_estimators": 299,
    "n_jobs": null,
    "num_parallel_tree": null,
    "random_state": 42,
    "reg_alpha": null,
    "reg_lambda": null,
    "sampling_method": null,
    "scale_pos_weight": null,
    "subsample": 0.7497780044672537,
    "tree_method": "hist",
    "validate_parameters": null,
    "verbosity": 0
  },
  "KMeans+Ridge": {
    "handle": "<pylibraft.common.handle.Handle object at 0x7a526e1d6340>",
    "verbose": 4,
    "output_type": "input",
    "n_init": "warn",
    "oversampling_factor": 2.0,
    "max_samples_per_batch": 32768,
    "init": "scalable-k-means++",
    "max_iter": 300,
    "n_clusters": 7,
    "random_state": 0,
    "tol": 0.0001,
    "convert_dtype": null
  },
  "SVR": {
    "handle": "<pylibraft.common.handle.Handle object at 0x7a5261c74a80>",
    "verbose": 4,
    "output_type": "input",
    "C": 5.154204395960415,
    "kernel": "rbf",
    "degree": 3,
    "gamma": 0.015374943340984342,
    "coef0": 0.0,
    "tol": 0.001,
    "cache_size": 1024.0,
    "max_iter": -1,
    "nochange_steps": 1000,
    "epsilon": 0.1
  },
  "Neural Network": {
    "name": "sequential",
    "trainable": true,
    "dtype": {
      "module": "keras",
      "class_name": "DTypePolicy",
      "config": {
        "name": "float32"
      },
      "registered_name": null
    },
    "layers": [
      {
        "module": "keras.layers",
        "class_name": "InputLayer",
        "config": {
          "batch_shape": [
            null,
            139
          ],
          "dtype": "float32",
          "sparse": false,
          "ragged": false,
          "name": "input_layer",
          "optional": false
        },
        "registered_name": null
      },
      {
        "module": "keras.layers",
        "class_name": "Dense",
        "config": {
          "name": "dense",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": {
              "name": "float32"
            },
            "registered_name": null
          },
          "units": 17,
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "module": "keras.initializers",
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            },
            "registered_name": null
          },
          "bias_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null,
          "quantization_config": null
        },
        "registered_name": null,
        "build_config": {
          "input_shape": [
            null,
            139
          ]
        }
      },
      {
        "module": "keras.layers",
        "class_name": "Dense",
        "config": {
          "name": "dense_1",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": {
              "name": "float32"
            },
            "registered_name": null
          },
          "units": 27,
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "module": "keras.initializers",
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            },
            "registered_name": null
          },
          "bias_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null,
          "quantization_config": null
        },
        "registered_name": null,
        "build_config": {
          "input_shape": [
            null,
            17
          ]
        }
      },
      {
        "module": "keras.layers",
        "class_name": "Dense",
        "config": {
          "name": "dense_2",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": {
              "name": "float32"
            },
            "registered_name": null
          },
          "units": 1,
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "module": "keras.initializers",
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            },
            "registered_name": null
          },
          "bias_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null,
          "quantization_config": null
        },
        "registered_name": null,
        "build_config": {
          "input_shape": [
            null,
            27
          ]
        }
      }
    ],
    "build_input_shape": [
      null,
      139
    ]
  }
}